app/views/logged/electricity.html.erb

SELECT  "limits".* FROM "limits" WHERE "limits"."meter_id" = ? LIMIT ?  [["meter_id", 1], ["LIMIT", 1]]
---
  <div class="myProgress">
    <div class="myBar" style="width: <%= ((@meter.value*100)/@limit.limit_value) %>%">