app/views/logged/water.html.erb

<div class="myProgress">
  <div class="myBar" style="width: <%= ((@meter.value*100)/@limit.limit_value) %>%">
---
SELECT  "limits".* FROM "limits" WHERE "limits"."meter_id" = ? LIMIT ?  [["meter_id", 2], ["LIMIT", 1]]