app/controllers/consumptions_controller.rb

  def index
    @consumptions = Consumption.all
---
SELECT "consumptions".* FROM "consumptions"