app/controllers/limites_controller.rb

SELECT "limites".* FROM "limites"
---
  def index
    @limites = Limite.all

INSERT INTO "limites" ("value", "meter_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["value", 30000], ["meter_id", 1], ["created_at", 2017-05-10 15:29:01 UTC], ["updated_at", 2017-05-10 15:29:01 UTC]]
---
  def create
    @limite = Limite.new(limite_params)

    respond_to do |format|
      if @limite.save

UPDATE "limites" SET "value" = ?, "updated_at" = ? WHERE "limites"."id" = ?  [["value", 30000], ["updated_at", 2017-05-20 17:28:50 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @limite.update(limite_params)

SELECT  "limites".* FROM "limites" WHERE "limites"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_limite
      @limite = Limite.find(params[:id])