app/controllers/limits_controller.rb

  def index
    @limits = Limit.all
---
SELECT "limits".* FROM "limits"

  def create
    @limit = Limit.new(limit_params)

    respond_to do |format|
      if @limit.save
---
INSERT INTO "limits" ("limit_value", "meter_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["limit_value", 20000], ["meter_id", 1], ["created_at", 2017-05-08 17:18:13 UTC], ["updated_at", 2017-05-08 17:18:13 UTC]]

    def set_limit
      @limit = Limit.find(params[:id])
---
SELECT  "limits".* FROM "limits" WHERE "limits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]