app/controllers/logged_controller.rb

  def electricity
    @meter = Meter.find_by(type_id:1, user_id: current_user.id)
    @limite= Limite.find_by(meter_id:(3*current_user.id-2))
    @consumption= Consumption.all
---
SELECT  "meters".* FROM "meters" WHERE "meters"."type_id" = ? AND "meters"."user_id" = ? LIMIT ?  [["type_id", 1], ["user_id", 2], ["LIMIT", 1]]
SELECT  "limites".* FROM "limites" WHERE "limites"."meter_id" = ? LIMIT ?  [["meter_id", 4], ["LIMIT", 1]]
SELECT "consumptions".* FROM "consumptions"

  def water
    @meter = Meter.find_by(type_id:2, user_id: current_user.id)
    @limite = Limite.find_by(meter_id:(3*current_user.id-1))
---
SELECT  "meters".* FROM "meters" WHERE "meters"."type_id" = ? AND "meters"."user_id" = ? LIMIT ?  [["type_id", 2], ["user_id", 2], ["LIMIT", 1]]
SELECT  "limites".* FROM "limites" WHERE "limites"."meter_id" = ? LIMIT ?  [["meter_id", 2], ["LIMIT", 1]]

  def gas
    @meter = Meter.find_by(type_id:3, user_id: current_user.id)
    @limite = Limite.find_by(meter_id:(3*current_user.id))
---
SELECT  "meters".* FROM "meters" WHERE "meters"."type_id" = ? AND "meters"."user_id" = ? LIMIT ?  [["type_id", 3], ["user_id", 2], ["LIMIT", 1]]
SELECT  "limites".* FROM "limites" WHERE "limites"."meter_id" = ? LIMIT ?  [["meter_id", 3], ["LIMIT", 1]]

  def create
      @limite = Limite.find_by(meter_id:(3*current_user.id-2))
      @limite.update_attributes(value: params[:limite][:value1])
---
SELECT  "limites".* FROM "limites" WHERE "limites"."meter_id" = ? LIMIT ?  [["meter_id", 3], ["LIMIT", 1]]
UPDATE "limites" SET "value" = ?, "updated_at" = ? WHERE "limites"."id" = ?  [["value", nil], ["updated_at", 2017-05-22 15:16:59 UTC], ["id", 3]]