app/controllers/logged_controller.rb

  def electricity
    @meter = Meter.find_by(type_id:1, user_id: current_user.id)
    @limit = Limit.find_by(meter_id:(3*current_user.id-2))
---
SELECT  "limits".* FROM "limits" WHERE "limits"."meter_id" = ? LIMIT ?  [["meter_id", 1], ["LIMIT", 1]]

  def water
    @meter = Meter.find_by(type_id:2, user_id: current_user.id)
    @limit = Limit.find_by(meter_id:(3*current_user.id-1))
---
SELECT  "limits".* FROM "limits" WHERE "limits"."meter_id" = ? LIMIT ?  [["meter_id", 2], ["LIMIT", 1]]

  def gas
    @meter = Meter.find_by(type_id:3, user_id: current_user.id)
    @limit = Limit.find_by(meter_id:(3*current_user.id))
---
SELECT  "limits".* FROM "limits" WHERE "limits"."meter_id" = ? LIMIT ?  [["meter_id", 3], ["LIMIT", 1]]