app/controllers/meters_controller.rb

SELECT "meters".* FROM "meters"
---
  def index
    @meters = Meter.all

INSERT INTO "meters" ("value", "type_id", "user_id", "created_at", "updated_at", "valueStartMonth") VALUES (?, ?, ?, ?, ?, ?)  [["value", 10000], ["type_id", 2], ["user_id", 4], ["created_at", 2017-05-29 17:36:05 UTC], ["updated_at", 2017-05-29 17:36:05 UTC], ["valueStartMonth", 9000]]
---
  def create
    @meter = Meter.new(meter_params)

    respond_to do |format|
      if @meter.save

UPDATE "meters" SET "valueStartMonth" = ?, "updated_at" = ? WHERE "meters"."id" = ?  [["valueStartMonth", 15000], ["updated_at", 2017-05-29 15:58:27 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @meter.update(meter_params)

DELETE FROM "meters" WHERE "meters"."id" = ?  [["id", 7]]
---
  def destroy
    @meter.destroy

SELECT  "meters".* FROM "meters" WHERE "meters"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_meter
      @meter = Meter.find(params[:id])